      *================================================================*
      *    MODULO......: Carteira de Clientes Vendedores Novos
      *    AUTHOR......: Leo Ribeiro e Silva Santos
      *    DATA........: 21/12/2019
      *    OBJETIVO ...: Linkage Area
      *================================================================*

       01 LK-MSG                   PIC X(80).
       01 LK-PARAM                 PIC X(01).
